app/views/parenttrips/_drivertrip.html.erb

    <tr >
        <% drivername = User.find_by(id: drivertrip.user_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]